app/Controllers/Produk.php

SELECT *
FROM `produk`
---
    public function index(): string
    {
        $produk = new ProdukModel();
        $data['produk'] = $produk->findAll();